import React, { useState } from "react";
import "../css/Clock.css";
import arrow from "../assets/images/arrow.png";

function Clock({ setShowNextBtn, setFinishLogistics }) {
  const [indexInfo, setIndexInfo] = useState(0);

  const info = [
    'בצה"ל כעת נהוג שימוש למשך 14 ימים בלבד',
    "הרכיב הראשון אשר יורד באיכותו - טסיות",
    "תוקף המנה מוטבע על השקית",
    'לאחר תום ה"תוקף" יש להחזיר בהקדם לבנק הדם',
  ];

  return (
    <div className="clock">
      <div className="clock-info-container">{info[indexInfo]}</div>
      <div className="clock-container">
        <img
          src={arrow}
          alt="arrow"
          className={`clock-arrow ${indexInfo === 3 ? "hide" : ""}`}
          onClick={() => {
            if (indexInfo + 1 === 3) {
              setShowNextBtn(true);
              setFinishLogistics(true);
            }
            setIndexInfo(indexInfo + 1);
          }}
        />

        <svg
          id="Layer_2-1"
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 465.14 522.45"
        >
          <g id="Layer_2-2" data-name="Layer_2">
            <path
              className="cls-1-1"
              d="M419.07,518.31c0,2.28-1.85,4.14-4.13,4.14H49.57c-1.14,0-2.18-.46-2.93-1.22-.75-.74-1.21-1.78-1.21-2.92,0-2.28,1.85-4.14,4.14-4.14h33.57l21.85-56.17,256.71-.62,20.77,56.79h32.47c1.14,0,2.17.46,2.92,1.22.75.74,1.21,1.78,1.21,2.92Z"
            />
            <rect
              className="cls-1-1"
              x="203.16"
              y="16.1"
              width="56.85"
              height="26.83"
            />
            <rect
              className="cls-5-1"
              x="186.75"
              y="0"
              width="90.34"
              height="19.71"
              rx="9.86"
              ry="9.86"
            />
          </g>
          <g id="Layer_3">
            <g>
              <path
                className="cls-7-1"
                d="M403.41,266.48v-.73c0-95.07-77.08-172.14-172.15-172.14v-31.16c-.02,10.39-.03,20.77-.05,31.16-95.05.03-172.09,77.09-172.09,172.14v.73c.39,94.74,77.3,171.41,172.12,171.42-.22,11.66-.22,23.24.02,34.63v-34.63c94.83,0,171.76-76.68,172.15-171.42ZM232.57,32.88C104.13,32.88,0,137,0,265.45s104.13,232.57,232.57,232.57,232.57-104.13,232.57-232.57S361.02,32.88,232.57,32.88ZM231.26,472.53c-113.24,0-205.04-91.8-205.04-205.04,0-.34,0-.67.01-1.01.54-112.78,92.13-204.03,205.03-204.03s204.49,91.25,205.03,204.03c.01.34.01.67.01,1.01,0,113.24-91.8,205.04-205.04,205.04Z"
              />
              <path
                className="cls-5-1"
                d="M436.3,267.49c0,113.24-91.8,205.04-205.04,205.04v-34.63c94.83,0,171.76-76.68,172.15-171.42h32.88c.01.34.01.67.01,1.01Z"
              />
              <path
                className={`cls-2-1 ${indexInfo >= 3 ? "cls-5-1" : ""}`}
                d="M403.41,266.48v-.73c0-95.07-77.08-172.14-172.15-172.14v-31.16c112.9,0,204.49,91.25,205.03,204.03h-32.88Z"
              />
              <path
                className={`cls-2-1 ${indexInfo >= 2 ? "cls-5-1" : ""}`}
                d="M231.26,62.45c-.02,10.39-.03,20.77-.05,31.16-95.05.03-172.09,77.09-172.09,172.14v.73H26.23c.54-112.78,92.13-204.03,205.03-204.03Z"
              />
              <path
                className={`cls-2-1 ${indexInfo >= 1 ? "cls-5-1" : ""}`}
                d="M231.26,472.53c-113.24,0-205.04-91.8-205.04-205.04,0-.34,0-.67.01-1.01h32.89c.39,94.74,77.3,171.41,172.12,171.42-.22,11.66-.22,23.24.02,34.63Z"
              />
              <path
                className="cls-6-1"
                d="M403.41,265.75v.73c-.39,94.74-77.32,171.42-172.15,171.42h-.02c-94.82-.01-171.73-76.68-172.12-171.42v-.73c0-95.05,77.04-172.11,172.09-172.14h.05c95.07,0,172.15,77.07,172.15,172.14Z"
              />
              <path
                className="cls-3-1"
                d="M231.27,62.45l-.05,31.16v-.65.65c.02-10.39.03-20.77.05-31.16Z"
              />
              <line
                className="cls-4-1"
                x1="436.29"
                y1="266.48"
                x2="403.41"
                y2="266.48"
              />
              <line
                className="cls-4-1"
                x1="59.13"
                y1="267.49"
                x2="26.22"
                y2="267.49"
              />
              <line
                className="cls-3-1"
                x1="231.25"
                y1="472.53"
                x2="231.25"
                y2="437.9"
              />
            </g>
          </g>
        </svg>
        <img
          src={arrow}
          alt="arrow"
          className={`clock-arrow ${
            indexInfo === 0 ? "hide" : ""
          } to-right-arrow`}
          onClick={() => setIndexInfo(indexInfo - 1)}
        />
      </div>
    </div>
  );
}

export default Clock;
